In [3]:
import pandas as pd

In [4]:
from datasets import load_dataset
import matplotlib.pyplot as plt

In [5]:
dataset = load_dataset("lukebarousse/data_jobs")

In [5]:
dataset

DatasetDict({
    train: Dataset({
        features: ['job_title_short', 'job_title', 'job_location', 'job_via', 'job_schedule_type', 'job_work_from_home', 'search_location', 'job_posted_date', 'job_no_degree_mention', 'job_health_insurance', 'job_country', 'salary_rate', 'salary_year_avg', 'salary_hour_avg', 'company_name', 'job_skills', 'job_type_skills'],
        num_rows: 785741
    })
})

In [6]:
df = dataset["train"].to_pandas()

In [7]:
df["job_posted_date"] = pd.to_datetime(df["job_posted_date"])

In [11]:
df.loc[:10, "salary_rate":"salary_hour_avg"].dropna(subset = "salary_rate")

Empty DataFrame
Columns: [salary_rate, salary_year_avg, salary_hour_avg]
Index: []

     job_country salary_rate
0  United States        None
1         Mexico        None
2        Germany        None
3  United States        None
4          Sudan        None